from django.shortcuts import render
from django.http import HttpResponse
# Create your views here.


def authors_all(request):
    return HttpResponse('''
    <a href="/">Домашня сторінка</a>
    <a href="/authors/top/">Список топових авторів</a>
    <a href="/authors/ukraine/">Список українських авторів</a>
    <a href="/authors/top/ukraine/">Список накращих українських авторів</a>
    <a href="/authors/usa/">Ссписок найкращих амереканських авторів</a>
''')


def authors_top(request):
    return HttpResponse('''
    <a href="/">Домашня сторінка</a>
    <a href="/authors/">Попередня сторінка</a>
    <h1>Top authors</h1>
        <li>Вільям Шекспір (Англія)</li>
        <li>Данте Аліг'єрі (Італія)</li>
        <li>Джейн Остін (Англія)</li>
        <li>Франс Кафка (Австро-Угорщина)</li>
        <li>Джордж Орвелл (Англія)</li>
        <li>Габріель Гарсіа Маркес (Колумбія)</li>
        <li>Марсель Пруст (Франція)</li>
        <li>Гомер (Стародавня Греція)</li>
        <li>Джеймс Джойс (Ірландія)</li>
        <li>Ернест Хемінгуей (США)</li>
        <li>Френсіс Скотт Фіцджеральд (США)</li>
        <li>Герман Гессе (Німеччина)</li>
        <li>Віктор Гюго (Франція)</li>
        <li>Мігель де Сервантес (Іспанія)</li>
        <li>Чарльз Діккенс (Англія)</li>
        <li>Маргарет Етвуд (Канада)</li>
        <li>Гарпер Лі (США)</li>
        <li>Рей Бредбері (США)</li>
        <li>Волт Вітмен (США)</li>
        <li>Альбер Камю (Франція)</li>
        <li>Хорхе Луїс Борхес (Аргентина)</li>
        <li>Мілан Кундера (Чехія)</li>
        <li>Томас Манн (Німеччина)</li>
        <li>Ісаак Азімов (США)</li>
        <li>Орхан Памук (Туреччина)</li>
        <li>Умберто Еко (Італія)</li>
        <li>Еліф Шафак (Туреччина)</li>
        <li>Пауло Коельйо (Бразилія)</li>
        <li>Чинуа Ачебе (Нігерія)</li>
''')


def authors_ukraine(request):
    return HttpResponse('''
    <a href="/">Домашня сторінка</a>
    <a href="/authors/">Попередня сторінка</a>
    <h1>Ukrainian authors</h1>
        <li>Тарас Шевченко</li>
        <li>Леся Українка</li>
        <li>Іван Франко</li>
        <li>Ольга Кобилянська</li>
        <li>Василь Стефаник</li>
        <li>Григорій Сковорода</li>
        <li>Ліна Костенко</li>
        <li>Василь Симоненко</li>
        <li>Оксана Забужко</li>
        <li>Юрій Андрухович</li>
        <li>Сергій Жадан</li>
        <li>Валер'ян Підмогильний</li>
        <li>Михайло Коцюбинський</li>
        <li>Марко Вовчок</li>
        <li>Пантелеймон Куліш</li>
        <li>Іван Нечуй-Левицький</li>
        <li>Микола Хвильовий</li>
        <li>Олександр Довженко</li>
        <li>Володимир Винниченко</li>
        <li>Іван Багряний</li>
        <li>Дмитро Павличко</li>
        <li>Євген Маланюк</li>
        <li>Богдан-Ігор Антонич</li>
        <li>Василь Стус</li>
        <li>Микола Вінграновський</li>
        <li>Павло Загребельний</li>
        <li>Юрій Винничук</li>
        <li>Ірина Вільде</li>
''')


def authors_usa(request):
    return HttpResponse('''
    <a href="/">Домашня сторінка</a>
    <a href="/authors/">Попередня сторінка</a>
    <h1>USA authors</h1>
        <li>Марк Твен</li>
        <li>Ернест Хемінгуей</li>
        <li>Френсіс Скотт Фіцджеральд</li>
        <li>Гарпер Лі</li>
        <li>Джек Лондон</li>
        <li>Едгар Аллан По</li>
        <li>Генрі Девід Торо</li>
        <li>Джон Стейнбек</li>
        <li>Тоні Моррісон</li>
        <li>Рей Бредбері</li>
''')


def authors_ukraine_top(request):
    return HttpResponse('''
    <a href="/">Домашня сторінка</a>
    <a href="/authors/">Попередня сторінка</a>
    <h1>Ukrainian TOP authors</h1>
        <li>Тарас Шевченко</li>
        <li>Леся Українка</li>
        <li>Іван Франко</li>
        <li>Микола Гоголь</li>
        <li>Ольга Кобилянська</li>
        <li>Василь Стефаник</li>
        <li>Григорій Сковорода</li>
        <li>Ліна Костенко</li>
        <li>Василь Симоненко</li>
        <li>Оксана Забужко</li>
''')